tutorials/suspensionFlows/oilWaxFoam/pipeline2D_meshed/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default          none;
    div(phi,U)      Gauss linearUpwindV grad(U);
    div(phi,Uslip)      Gauss linearUpwindV grad(Uslip);
    div((nu*dev2(grad(U).T()))) Gauss linear;
    div(phi,psi)    Gauss vanLeer; //Gauss linearUpwind grad(psi); //linearUpwind grad(psi);
    div(phi,c)      Gauss linearUpwind grad(c); //Gauss linearUpwind grad(c);
    div(phi,T)      Gauss linearUpwind grad(T);   
    div(((psi*nu)*dev2(grad(Uslip).T()))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
